# IFCParameter Template Constructor

Source: https://www.revitapidocs.com/2026/abc5725d-1ce6-ad2c-83f6-79eb31666dc1.htm

---

| IFCParameter Template Constructor |
| --- |

Custom constructor for this element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCParameterTemplate(
	Document document
)
```

```
Public Sub New (
	document As Document
)
```

```
public:
IFCParameterTemplate(
	Document^ document
)
```

```
new :
        document : Document -> IFCParameterTemplate
```

#### Parameters

document Document
:   The document where created template is saved.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace